FSI/cylinderFlap/dealii-OpenFOAM/Fluid/constant/dynamicMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh dynamicMotionSolverFvMesh;

motionSolverLibs ("libfvMotionSolvers.so");

solver      displacementLaplacian;

displacementLaplacianCoeffs {

    diffusivity quadratic inverseDistance (flap);

}